app/Controllers/AtividadeController.php

    public function listar()
    {
        $atividades = $this->atividade->paginate(10);
---
SELECT *
FROM `atividades`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `atividades`

    public function onSave()
    {
        $dados = [
            "idAtividade" => $this->request->getPost("idAtividade"),
            "nome" => $this->request->getPost("nome"),
            "valor" => $this->request->getPost("valor")
        ];
        if (empty($dados["idAtividade"])) {
            if ($this->atividade->save($dados)) {
---
UPDATE `atividades` SET `nome` = 'Torno de bancada', `valor` = '175'
WHERE `atividades`.`idAtividade` IN ('1')