app/Controllers/CidadeController.php

    public function listar()
    {
        $cidades = $this->cidade->select(
            "cidades.idCidade as idCidade, cidades.nome as nomeCidade,
            estados.sigla as siglaEstado"
        )->join(
            "estados",
            "estados.idEstado=cidades.idEstado",
            "inner"
        )->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `cidades`
INNER JOIN `estados` ON `estados`.`idEstado`=`cidades`.`idEstado`
SELECT `cidades`.`idCidade` as `idCidade`, `cidades`.`nome` as `nomeCidade`, `estados`.`sigla` as `siglaEstado`
FROM `cidades`
INNER JOIN `estados` ON `estados`.`idEstado`=`cidades`.`idEstado`
 LIMIT 10