app/Controllers/ClienteController.php

    public function listar()
    {
        $clientes = $this->cliente->paginate(10);
---
SELECT *
FROM `clientes`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `clientes`

    public function inserir()
    {

        $localidades = $this->localidade->findAll();
---
SELECT *
FROM `localidades`

    public function editar(int $param)
    {

        $cliente = $this->cliente->find($param);
        $localidades = $this->localidade->findAll();
---
SELECT *
FROM `localidades`

    public function onSave()
    {
        //inputs estáticos
        $dados_cliente = [
            "idCliente" => $this->request->getPost("idCliente"),
            "categoria" => $this->request->getPost("categoria"),
            "nome" => $this->request->getPost("nome"),
            "cpfCnpj" => $this->request->getPost("cpfCnpj"),
            "idLocalidade" => $this->request->getPost("idLocalidade"),
            "endereco" => $this->request->getPost("endereco"),
            "numero" => $this->request->getPost("numero"),
            "complemento" => $this->request->getPost("complemento"),
            "email" => $this->request->getPost("email")
        ];
        //var_dump($dados_cliente);die;

        if (empty($dados_cliente["idCliente"])) {
            if ($this->cliente->save($dados_cliente)) {
---
INSERT INTO `clientes` (`categoria`, `nome`, `cpfCnpj`, `idLocalidade`, `endereco`, `numero`, `complemento`, `email`) VALUES ('1', 'Mauro Luis', '3', '1', 'Rua Coronel Lago', '880', 'Sala 04', 'mauro.luis@email.com')