app/Controllers/EspecificacaoController.php

    public function listar()
    {
        $especificacoes = $this->especificacao->select(
            "especificacoes.idEspecificacao as idEspec,
             especificacoes.dimensao as dismensaoEspec,
             especificacoes.especificacao as especEspec,
             pecas.nome as nomePeca"
        )->join(
            "pecas",
            "pecas.idPeca=especificacoes.idPeca",
            "inner"
        )->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `especificacoes`
INNER JOIN `pecas` ON `pecas`.`idPeca`=`especificacoes`.`idPeca`
SELECT `especificacoes`.`idEspecificacao` as `idEspec`, `especificacoes`.`dimensao` as `dismensaoEspec`, `especificacoes`.`especificacao` as `especEspec`, `pecas`.`nome` as `nomePeca`
FROM `especificacoes`
INNER JOIN `pecas` ON `pecas`.`idPeca`=`especificacoes`.`idPeca`
 LIMIT 10

    public function inserir()
    {
        $pecas = $this->peca->findAll();
---
SELECT *
FROM `pecas`