app/Controllers/EstadoController.php

    public function listar()
    {
        $estados = $this->estado->paginate(10);
---
SELECT *
FROM `estados`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `estados`