app/Controllers/EstoqueController.php

SELECT COUNT(*) AS `numrows`
FROM `estoques`
INNER JOIN `especificacoes` ON `especificacoes`.`idEspecificacao`=`estoques`.`idEspecificacao`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`estoques`.`idMarca`
JOIN `pecas` ON `pecas`.`idPeca`=`especificacoes`.`idPeca`
SELECT `estoques`.`idEstoque` as `idEstoque`, `pecas`.`nome` as `nomePeca`, `especificacoes`.`dimensao` as `dimensaoEspec`, `marcas`.`nome` as `nomeMarca`
FROM `estoques`
INNER JOIN `especificacoes` ON `especificacoes`.`idEspecificacao`=`estoques`.`idEspecificacao`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`estoques`.`idMarca`
JOIN `pecas` ON `pecas`.`idPeca`=`especificacoes`.`idPeca`
 LIMIT 10
---
    public function listar()
    {
        $estoques = $this->estoque->select(
            "estoques.idEstoque as idEstoque,
             pecas.nome as nomePeca,
             especificacoes.dimensao as dimensaoEspec,
             marcas.nome as nomeMarca"
        )->join(
            "especificacoes",
            "especificacoes.idEspecificacao=estoques.idEspecificacao",
            "inner"
        )->join(
            "marcas",
            "marcas.idMarca=estoques.idMarca",
            "inner"
        )->join(
            "pecas",
            "pecas.idPeca=especificacoes.idPeca"
        )->paginate(10);

SELECT *
FROM `marcas`
SELECT `especificacoes`.`idEspecificacao` as `idEspec`, `especificacoes`.`dimensao` as `dimensaoEspec`, `especificacoes`.`especificacao` as `especEspec`, `pecas`.`nome` as `nomePeca`
FROM `especificacoes`
INNER JOIN `pecas` ON `especificacoes`.`idPeca`=`pecas`.`idPeca`
---
    public function editar(int $param)
    {
        $estoque = $this->estoque->find($param);
        $marcas = $this->marca->findAll();
        $especificacoes = $this->especificacao->select(
            "especificacoes.idEspecificacao as idEspec, especificacoes.dimensao as dimensaoEspec, especificacoes.especificacao as especEspec,
            pecas.nome as nomePeca"
        )->join(
            "pecas",
            "especificacoes.idPeca=pecas.idPeca",
            "inner"
        )->findAll();