app/Controllers/InscricaoController.php

SELECT `clientes`.`idCliente`, `clientes`.`nome` as `nomeCliente`, `clientes`.`cpfCnpj` as `cpfCnpjCliente`, `clientes`.`categoria` as `categoriaCliente`
FROM `clientes`
WHERE `clientes`.`idCliente` = 1
SELECT `clientes`.`idCliente`, `clientes`.`nome` as `nomeCliente`, `clientes`.`categoria` as `categoriaCliente`, `clientes`.`cpfCnpj` as `cpfCnpjCliente`
FROM `clientes`
WHERE `clientes`.`idCliente` = 1
---
    public function listar(int $idCliente){
        $cliente = $this->cliente->select(
            "clientes.idCliente, clientes.nome as nomeCliente, clientes.cpfCnpj as cpfCnpjCliente,
            clientes.categoria as categoriaCliente"
        )->find($idCliente);

SELECT *
FROM `clientes`
WHERE `clientes`.`idCliente` = 1
---
    public function editar(int $idIncricacao)
    {
        $inscricao = $this->inscricao->find($idIncricacao);
        $dados_cliente = $this->cliente->find($inscricao->idCliente);