app/Controllers/InscricaoController.php

SELECT COUNT(*) AS `numrows`
FROM `inscricoes`
INNER JOIN `localidades` ON `localidades`.`idLocalidade`=`inscricoes`.`idLocalidade`
INNER JOIN `cidades` ON `cidades`.`idCidade`=`localidades`.`idCidade`
INNER JOIN `estados` ON `estados`.`idEstado`=`cidades`.`idEstado`
WHERE `idCliente` = 6
SELECT `inscricoes`.`idInscricao`, `inscricoes`.`nome` as `nomeInscricao`, `localidades`.`nome` as `nomeLocalidade`, `cidades`.`nome` as `nomeCidade`, `estados`.`sigla` as `siglaEstado`
FROM `inscricoes`
INNER JOIN `localidades` ON `localidades`.`idLocalidade`=`inscricoes`.`idLocalidade`
INNER JOIN `cidades` ON `cidades`.`idCidade`=`localidades`.`idCidade`
INNER JOIN `estados` ON `estados`.`idEstado`=`cidades`.`idEstado`
WHERE `idCliente` = 6
 LIMIT 10
---
    public function listar(int $idCliente)
    {
        $cliente = $this->cliente->find($idCliente);
        $inscricoes = $this->inscricao->select(
            "inscricoes.idInscricao, inscricoes.nome as nomeInscricao,
            localidades.nome as nomeLocalidade, cidades.nome as nomeCidade, estados.sigla as siglaEstado"
        )->join(
            "localidades",
            "localidades.idLocalidade=inscricoes.idLocalidade",
            "inner"
        )->join(
            "cidades",
            "cidades.idCidade=localidades.idCidade",
            "inner"
        )->join(
            "estados",
            "estados.idEstado=cidades.idEstado",
            "inner"
        )->where("idCliente", $idCliente)->paginate(10);