app/Controllers/LocalidadeController.php

SELECT COUNT(*) AS `numrows`
FROM `localidades`
INNER JOIN `cidades` ON `cidades`.`idCidade`=`localidades`.`idCidade`
INNER JOIN `estados` ON `estados`.`idEstado`=`cidades`.`idEstado`
SELECT `localidades`.`idLocalidade` as `idLocalidade`, `localidades`.`nome` as `nomeLocalidade`, `cidades`.`nome` as `nomeCidade`, `estados`.`sigla` as `siglaEstado`
FROM `localidades`
INNER JOIN `cidades` ON `cidades`.`idCidade`=`localidades`.`idCidade`
INNER JOIN `estados` ON `estados`.`idEstado`=`cidades`.`idEstado`
 LIMIT 10
---
    public function listar()
    {
        $localidades = $this->localidade->select(
            "localidades.idLocalidade as idLocalidade, localidades.nome as nomeLocalidade,
            cidades.nome as nomeCidade,
            estados.sigla as siglaEstado"
        )->join(
            "cidades",
            "cidades.idCidade=localidades.idCidade",
            "inner"
        )->join(
            "estados",
            "estados.idEstado=cidades.idEstado",
            "inner"
        )->paginate(10);

SELECT `cidades`.`idCidade` as `idCidade`, `cidades`.`nome` as `nomeCidade`, `estados`.`sigla` as `siglaEstado`
FROM `cidades`
INNER JOIN `estados` ON `estados`.`idEstado`=`cidades`.`idEstado`
---
    public function inserir()
    {
        $cidades = $this->cidade->select(
            "cidades.idCidade as idCidade, cidades.nome as nomeCidade,
            estados.sigla as siglaEstado"
        )->join(
            "estados",
            "estados.idEstado=cidades.idEstado",
            "inner"
        )->findAll();