app/Controllers/MaquinarioController.php

    public function onSave()
    {
        $dados = [
            "idMaquinario" => $this->request->getPost("idMaquinario"),
            "nome" => $this->request->getPost("nome")
        ];

        if (empty($dados["idMaquinario"])|| $dados["idMaquinario"] == "") {
            if ($this->maquinario->save($dados)) {
---
INSERT INTO `maquinarios` (`nome`) VALUES ('Trator 100 - 210 HP')