app/Controllers/MarcaController.php

    public function listar()
    {
        $marcas = $this->marca->paginate(10);
---
SELECT *
FROM `marcas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `marcas`

    public function onSave(){
        $dados = [
            "idMarca" => $this->request->getPost("idMarca"),
            "nome" => $this->request->getPost("nome")
        ];

        if(empty($dados["idMarca"])){
            if($this->marca->save($dados)){
---
INSERT INTO `marcas` (`nome`) VALUES ('Case')