app/Controllers/ModeloController.php

SELECT COUNT(*) AS `numrows`
FROM `modelos`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`modelos`.`idMarca`
INNER JOIN `maquinarios` ON `maquinarios`.`idMaquinario`=`modelos`.`idMaquinario`
SELECT `modelos`.`idModelo` as `idModelo`, `modelos`.`nome` as `nomeModelo`, `marcas`.`nome` as `nomeMarca`, `maquinarios`.`nome` as `nomeMaquinario`
FROM `modelos`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`modelos`.`idMarca`
INNER JOIN `maquinarios` ON `maquinarios`.`idMaquinario`=`modelos`.`idMaquinario`
 LIMIT 10
---
    public function listar()
    {
        $modelos = $this->modelo->select(
            "modelos.idModelo as idModelo, modelos.nome as nomeModelo,
            marcas.nome as nomeMarca,
            maquinarios.nome as nomeMaquinario"
        )->join(
            "marcas",
            "marcas.idMarca=modelos.idMarca",
            "inner"
        )->join(
            "maquinarios",
            "maquinarios.idMaquinario=modelos.idMaquinario",
            "inner"
        )->paginate(10);