app/Controllers/OrcamentoController.php

SELECT *
FROM `clientes`
WHERE `clientes`.`idCliente` = 1
SELECT `maquinarios`.`nome` as `nomeMaquinario`, `marcas`.`nome` as `nomeMarca`, `modelos`.`nome` as `nomeModelo`, `series`.`idSerie`, `series`.`descricao` as `descricaoSerie`
FROM `series`
INNER JOIN `modelos` ON `modelos`.`idModelo`=`series`.`idModelo`
INNER JOIN `maquinarios` ON `maquinarios`.`idMaquinario`=`modelos`.`idMaquinario`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`modelos`.`idMarca`
---
    public function inserir(int $idCliente)
    {
        $cliente = $this->cliente->find($idCliente);
        //var_dump($cliente);die;
        $series = $this->serie->select(
            "maquinarios.nome as nomeMaquinario,
            marcas.nome as nomeMarca,
            modelos.nome as nomeModelo,
            series.idSerie, series.descricao as descricaoSerie"
        )->join(
            "modelos",
            "modelos.idModelo=series.idModelo",
            "inner"
        )->join(
            "maquinarios",
            "maquinarios.idMaquinario=modelos.idMaquinario",
            "inner"
        )->join(
            "marcas",
            "marcas.idMarca=modelos.idMarca",
            "inner"
        )->orderBy("idSerie","asc")->findAll();