app/Controllers/PecaController.php

    public function listar()
    {
        $pecas = $this->peca->paginate(10);
---
SELECT *
FROM `pecas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pecas`