app/Controllers/ProdutoController.php

SELECT `orcamentos`.`idOrcamento`, `orcamentos`.`observacao` as `observacaoOrcamento`, `servicos`.`titulo` as `tituloServico`, `series`.`descricao` as `descricaoSerie`, `modelos`.`nome` as `nomeModelo`, `marcas`.`nome` as `nomeMarca`, `clientes`.`nome` as `nomeCliente`
FROM `servicos`
INNER JOIN `orcamentos` ON `orcamentos`.`idOrcamento`=`servicos`.`idOrcamento`
INNER JOIN `clientes` ON `clientes`.`idCliente`=`orcamentos`.`idCliente`
INNER JOIN `series` ON `series`.`idSerie`=`orcamentos`.`idSerie`
INNER JOIN `modelos` ON `modelos`.`idModelo`=`series`.`idModelo`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`modelos`.`idMarca`
WHERE `idServico` = 4
 LIMIT 1
---
    public function listar(int $idServico)
    {

        $infoServico = $this->servico->select(
            "orcamentos.idOrcamento, orcamentos.observacao as observacaoOrcamento,
            servicos.titulo as tituloServico,
            series.descricao as descricaoSerie,
            modelos.nome as nomeModelo,
            marcas.nome as nomeMarca,
            clientes.nome as nomeCliente"
        )->join(
            "orcamentos",
            "orcamentos.idOrcamento=servicos.idOrcamento",
            "inner"
        )->join(
            "clientes",
            "clientes.idCliente=orcamentos.idCliente",
            "inner"
        )->join(
            "series",
            "series.idSerie=orcamentos.idSerie",
            "inner"
        )->join(
            "modelos",
            "modelos.idModelo=series.idModelo",
            "inner"
        )->join(
            "marcas",
            "marcas.idMarca=modelos.idMarca",
            "inner"
        )->where("idServico",$idServico)->first();