app/Controllers/SerieController.php

SELECT COUNT(*) AS `numrows`
FROM `series`
INNER JOIN `modelos` ON `modelos`.`idModelo`=`series`.`idModelo`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`modelos`.`idMarca`
SELECT `series`.`idSerie` as `idSerie`, `series`.`descricao` as `descricaoSerie`, `modelos`.`nome` as `nomeModelo`, `marcas`.`nome` as `nomeMarca`
FROM `series`
INNER JOIN `modelos` ON `modelos`.`idModelo`=`series`.`idModelo`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`modelos`.`idMarca`
ORDER BY `idSerie`
 LIMIT 10
---
    public function listar()
    {
        $series = $this->serie->select(
            "series.idSerie as idSerie, series.descricao as descricaoSerie,
            modelos.nome as nomeModelo,
            marcas.nome as nomeMarca"
        )->join(
            "modelos",
            "modelos.idModelo=series.idModelo",
            "inner"
        )->join(
            "marcas",
            "marcas.idMarca=modelos.idMarca",
            "inner"
        )->orderBy("idSerie")->paginate(10);

UPDATE `series` SET `idModelo` = '3', `descricao` = '90'
WHERE `series`.`idSerie` IN ('4')
---
    public function onSave()
    {
        $dados = [
            "idSerie"   => $this->request->getPost("idSerie"),
            "idModelo"  => $this->request->getPost("idModelo"),
            "descricao" => $this->request->getPost("descricao"),
        ];

        //var_dump($dados);die;

        if (empty($dados["idSerie"])) {
            if ($this->serie->save($dados)) {
                return redirect()->route("serie.listar")->with(
                    "info",
                    "<strong> <i class='bi bi-check-circle-fill'></i> Inserção realizada com sucesso </strong>" .
                        $dados["descricao"]
                );
            } else {
                return redirect()->back()->with("errors", $this->serie->errors());
            }
        } else {
            if ($this->serie->save($dados)) {