app/Controllers/ServicoController.php

SELECT *
FROM `orcamentos`
WHERE `orcamentos`.`idOrcamento` = 1
SELECT `marcas`.`nome` as `nomeMarca`, `modelos`.`nome` as `nomeModelo`, `series`.`descricao` as `descricaoSerie`
FROM `orcamentos`
INNER JOIN `series` ON `series`.`idSerie`=`orcamentos`.`idSerie`
INNER JOIN `modelos` ON `modelos`.`idModelo`=`series`.`idModelo`
INNER JOIN `marcas` ON `marcas`.`idMarca`=`modelos`.`idMarca`
WHERE `orcamentos`.`idOrcamento` = 1
SELECT `idCliente`, `nome`
FROM `clientes`
WHERE `clientes`.`idCliente` = '1'
SELECT *
FROM `servicos`
WHERE `idOrcamento` = '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `servicos`
WHERE `idOrcamento` = '1'
---
    public function listar(int $idOrcamento)
    {
        $orcamento = $this->orcamento->find($idOrcamento);
        $maquinario = $this->orcamento->select(
            "marcas.nome as nomeMarca,
            modelos.nome as nomeModelo,
            series.descricao as descricaoSerie"
        )->join(
            "series",
            "series.idSerie=orcamentos.idSerie",
            "inner"
        )->join(
            "modelos",
            "modelos.idModelo=series.idModelo",
            "inner"
        )->join(
            "marcas",
            "marcas.idMarca=modelos.idMarca",
            "inner"
        )->find($idOrcamento);
        $cliente = $this->cliente->select("idCliente,nome")->find($orcamento->idCliente);
        $servicos = $this->servico->where("idOrcamento", $orcamento->idOrcamento)->paginate(10);

SELECT *
FROM `servicos`
WHERE `servicos`.`idServico` = 1
SELECT *
FROM `atividades`
---
    public function editar(int $idServico)
    {

        $servico = $this->servico->find($idServico);
        $atividades = $this->atividade->findAll();